GopalSaraf/Practicals/PSDL/include/proc/pic18f4480.inc
// Register: RXF7SIDH
#define RXF7SIDH RXF7SIDH
RXF7SIDH                                 equ 0D64h
// bitfield definitions
RXF7SIDH_SID3_POSN                       equ 0000h
RXF7SIDH_SID3_POSITION                   equ 0000h
RXF7SIDH_SID3_SIZE                       equ 0001h
RXF7SIDH_SID3_LENGTH                     equ 0001h
RXF7SIDH_SID3_MASK                       equ 0001h
RXF7SIDH_SID4_POSN                       equ 0001h
RXF7SIDH_SID4_POSITION                   equ 0001h
RXF7SIDH_SID4_SIZE                       equ 0001h
RXF7SIDH_SID4_LENGTH                     equ 0001h
RXF7SIDH_SID4_MASK                       equ 0002h
RXF7SIDH_SID5_POSN                       equ 0002h
RXF7SIDH_SID5_POSITION                   equ 0002h
RXF7SIDH_SID5_SIZE                       equ 0001h
RXF7SIDH_SID5_LENGTH                     equ 0001h
RXF7SIDH_SID5_MASK                       equ 0004h
RXF7SIDH_SID6_POSN                       equ 0003h
RXF7SIDH_SID6_POSITION                   equ 0003h
RXF7SIDH_SID6_SIZE                       equ 0001h
RXF7SIDH_SID6_LENGTH                     equ 0001h
RXF7SIDH_SID6_MASK                       equ 0008h
RXF7SIDH_SID7_POSN                       equ 0004h
RXF7SIDH_SID7_POSITION                   equ 0004h
RXF7SIDH_SID7_SIZE                       equ 0001h
RXF7SIDH_SID7_LENGTH                     equ 0001h
RXF7SIDH_SID7_MASK                       equ 0010h
RXF7SIDH_SID8_POSN                       equ 0005h
RXF7SIDH_SID8_POSITION                   equ 0005h
RXF7SIDH_SID8_SIZE                       equ 0001h
RXF7SIDH_SID8_LENGTH                     equ 0001h
RXF7SIDH_SID8_MASK                       equ 0020h
RXF7SIDH_SID9_POSN                       equ 0006h
RXF7SIDH_SID9_POSITION                   equ 0006h
RXF7SIDH_SID9_SIZE                       equ 0001h
RXF7SIDH_SID9_LENGTH                     equ 0001h
RXF7SIDH_SID9_MASK                       equ 0040h
RXF7SIDH_SID10_POSN                      equ 0007h
RXF7SIDH_SID10_POSITION                  equ 0007h
RXF7SIDH_SID10_SIZE                      equ 0001h
RXF7SIDH_SID10_LENGTH                    equ 0001h
RXF7SIDH_SID10_MASK                      equ 0080h
RXF7SIDH_RXF7SID3_POSN                   equ 0000h
RXF7SIDH_RXF7SID3_POSITION               equ 0000h
RXF7SIDH_RXF7SID3_SIZE                   equ 0001h
RXF7SIDH_RXF7SID3_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID3_MASK                   equ 0001h
RXF7SIDH_RXF7SID4_POSN                   equ 0001h
RXF7SIDH_RXF7SID4_POSITION               equ 0001h
RXF7SIDH_RXF7SID4_SIZE                   equ 0001h
RXF7SIDH_RXF7SID4_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID4_MASK                   equ 0002h
RXF7SIDH_RXF7SID5_POSN                   equ 0002h
RXF7SIDH_RXF7SID5_POSITION               equ 0002h
RXF7SIDH_RXF7SID5_SIZE                   equ 0001h
RXF7SIDH_RXF7SID5_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID5_MASK                   equ 0004h
RXF7SIDH_RXF7SID6_POSN                   equ 0003h
RXF7SIDH_RXF7SID6_POSITION               equ 0003h
RXF7SIDH_RXF7SID6_SIZE                   equ 0001h
RXF7SIDH_RXF7SID6_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID6_MASK                   equ 0008h
RXF7SIDH_RXF7SID7_POSN                   equ 0004h
RXF7SIDH_RXF7SID7_POSITION               equ 0004h
RXF7SIDH_RXF7SID7_SIZE                   equ 0001h
RXF7SIDH_RXF7SID7_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID7_MASK                   equ 0010h
RXF7SIDH_RXF7SID8_POSN                   equ 0005h
RXF7SIDH_RXF7SID8_POSITION               equ 0005h
RXF7SIDH_RXF7SID8_SIZE                   equ 0001h
RXF7SIDH_RXF7SID8_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID8_MASK                   equ 0020h
RXF7SIDH_RXF7SID9_POSN                   equ 0006h
RXF7SIDH_RXF7SID9_POSITION               equ 0006h
RXF7SIDH_RXF7SID9_SIZE                   equ 0001h
RXF7SIDH_RXF7SID9_LENGTH                 equ 0001h
RXF7SIDH_RXF7SID9_MASK                   equ 0040h
RXF7SIDH_RXF7SID10_POSN                  equ 0007h
RXF7SIDH_RXF7SID10_POSITION              equ 0007h
RXF7SIDH_RXF7SID10_SIZE                  equ 0001h
RXF7SIDH_RXF7SID10_LENGTH                equ 0001h
RXF7SIDH_RXF7SID10_MASK                  equ 0080h

// Register: RXF7SIDL
#define RXF7SIDL RXF7SIDL
RXF7SIDL                                 equ 0D65h
// bitfield definitions
RXF7SIDL_EID16_POSN                      equ 0000h
RXF7SIDL_EID16_POSITION                  equ 0000h
RXF7SIDL_EID16_SIZE                      equ 0001h
RXF7SIDL_EID16_LENGTH                    equ 0001h
RXF7SIDL_EID16_MASK                      equ 0001h
RXF7SIDL_EID17_POSN                      equ 0001h
RXF7SIDL_EID17_POSITION                  equ 0001h
RXF7SIDL_EID17_SIZE                      equ 0001h
RXF7SIDL_EID17_LENGTH                    equ 0001h
RXF7SIDL_EID17_MASK                      equ 0002h
RXF7SIDL_EXIDEN_POSN                     equ 0003h
RXF7SIDL_EXIDEN_POSITION                 equ 0003h
RXF7SIDL_EXIDEN_SIZE                     equ 0001h
RXF7SIDL_EXIDEN_LENGTH                   equ 0001h
RXF7SIDL_EXIDEN_MASK                     equ 0008h
RXF7SIDL_SID0_POSN                       equ 0005h
RXF7SIDL_SID0_POSITION                   equ 0005h
RXF7SIDL_SID0_SIZE                       equ 0001h
RXF7SIDL_SID0_LENGTH                     equ 0001h
RXF7SIDL_SID0_MASK                       equ 0020h
RXF7SIDL_SID1_POSN                       equ 0006h
RXF7SIDL_SID1_POSITION                   equ 0006h
RXF7SIDL_SID1_SIZE                       equ 0001h
RXF7SIDL_SID1_LENGTH                     equ 0001h
RXF7SIDL_SID1_MASK                       equ 0040h
RXF7SIDL_SID2_POSN                       equ 0007h
RXF7SIDL_SID2_POSITION                   equ 0007h
RXF7SIDL_SID2_SIZE                       equ 0001h
RXF7SIDL_SID2_LENGTH                     equ 0001h
RXF7SIDL_SID2_MASK                       equ 0080h
RXF7SIDL_EXIDE_POSN                      equ 0003h
RXF7SIDL_EXIDE_POSITION                  equ 0003h
RXF7SIDL_EXIDE_SIZE                      equ 0001h
RXF7SIDL_EXIDE_LENGTH                    equ 0001h
RXF7SIDL_EXIDE_MASK                      equ 0008h
RXF7SIDL_RXF7EID16_POSN                  equ 0000h
RXF7SIDL_RXF7EID16_POSITION              equ 0000h
RXF7SIDL_RXF7EID16_SIZE                  equ 0001h
RXF7SIDL_RXF7EID16_LENGTH                equ 0001h
RXF7SIDL_RXF7EID16_MASK                  equ 0001h
RXF7SIDL_RXF7EID17_POSN                  equ 0001h
RXF7SIDL_RXF7EID17_POSITION              equ 0001h
RXF7SIDL_RXF7EID17_SIZE                  equ 0001h
RXF7SIDL_RXF7EID17_LENGTH                equ 0001h
RXF7SIDL_RXF7EID17_MASK                  equ 0002h
RXF7SIDL_RXF7EXIDEN_POSN                 equ 0003h
RXF7SIDL_RXF7EXIDEN_POSITION             equ 0003h
RXF7SIDL_RXF7EXIDEN_SIZE                 equ 0001h
RXF7SIDL_RXF7EXIDEN_LENGTH               equ 0001h
RXF7SIDL_RXF7EXIDEN_MASK                 equ 0008h
RXF7SIDL_RXF7SID0_POSN                   equ 0005h
RXF7SIDL_RXF7SID0_POSITION               equ 0005h
RXF7SIDL_RXF7SID0_SIZE                   equ 0001h
RXF7SIDL_RXF7SID0_LENGTH                 equ 0001h
RXF7SIDL_RXF7SID0_MASK                   equ 0020h
RXF7SIDL_RXF7SID1_POSN                   equ 0006h
RXF7SIDL_RXF7SID1_POSITION               equ 0006h
RXF7SIDL_RXF7SID1_SIZE                   equ 0001h
RXF7SIDL_RXF7SID1_LENGTH                 equ 0001h
RXF7SIDL_RXF7SID1_MASK                   equ 0040h
RXF7SIDL_RXF7SID2_POSN                   equ 0007h
RXF7SIDL_RXF7SID2_POSITION               equ 0007h
RXF7SIDL_RXF7SID2_SIZE                   equ 0001h
RXF7SIDL_RXF7SID2_LENGTH                 equ 0001h
RXF7SIDL_RXF7SID2_MASK                   equ 0080h

// Register: RXF7EIDH
#define RXF7EIDH RXF7EIDH
RXF7EIDH                                 equ 0D66h
// bitfield definitions
RXF7EIDH_EID8_POSN                       equ 0000h
RXF7EIDH_EID8_POSITION                   equ 0000h
RXF7EIDH_EID8_SIZE                       equ 0001h
RXF7EIDH_EID8_LENGTH                     equ 0001h
RXF7EIDH_EID8_MASK                       equ 0001h
RXF7EIDH_EID9_POSN                       equ 0001h
RXF7EIDH_EID9_POSITION                   equ 0001h
RXF7EIDH_EID9_SIZE                       equ 0001h
RXF7EIDH_EID9_LENGTH                     equ 0001h
RXF7EIDH_EID9_MASK                       equ 0002h
RXF7EIDH_EID10_POSN                      equ 0002h
RXF7EIDH_EID10_POSITION                  equ 0002h
RXF7EIDH_EID10_SIZE                      equ 0001h
RXF7EIDH_EID10_LENGTH                    equ 0001h
RXF7EIDH_EID10_MASK                      equ 0004h
RXF7EIDH_EID11_POSN                      equ 0003h
RXF7EIDH_EID11_POSITION                  equ 0003h
RXF7EIDH_EID11_SIZE                      equ 0001h
RXF7EIDH_EID11_LENGTH                    equ 0001h
RXF7EIDH_EID11_MASK                      equ 0008h
RXF7EIDH_EID12_POSN                      equ 0004h
RXF7EIDH_EID12_POSITION                  equ 0004h
RXF7EIDH_EID12_SIZE                      equ 0001h
RXF7EIDH_EID12_LENGTH                    equ 0001h
RXF7EIDH_EID12_MASK                      equ 0010h
RXF7EIDH_EID13_POSN                      equ 0005h
RXF7EIDH_EID13_POSITION                  equ 0005h
RXF7EIDH_EID13_SIZE                      equ 0001h
RXF7EIDH_EID13_LENGTH                    equ 0001h
RXF7EIDH_EID13_MASK                      equ 0020h
RXF7EIDH_EID14_POSN                      equ 0006h
RXF7EIDH_EID14_POSITION                  equ 0006h
RXF7EIDH_EID14_SIZE                      equ 0001h
RXF7EIDH_EID14_LENGTH                    equ 0001h
RXF7EIDH_EID14_MASK                      equ 0040h
RXF7EIDH_EID15_POSN                      equ 0007h
RXF7EIDH_EID15_POSITION                  equ 0007h
RXF7EIDH_EID15_SIZE                      equ 0001h
RXF7EIDH_EID15_LENGTH                    equ 0001h
RXF7EIDH_EID15_MASK                      equ 0080h
RXF7EIDH_RXF7EID8_POSN                   equ 0000h
RXF7EIDH_RXF7EID8_POSITION               equ 0000h
RXF7EIDH_RXF7EID8_SIZE                   equ 0001h
RXF7EIDH_RXF7EID8_LENGTH                 equ 0001h
RXF7EIDH_RXF7EID8_MASK                   equ 0001h
RXF7EIDH_RXF7EID9_POSN                   equ 0001h
RXF7EIDH_RXF7EID9_POSITION               equ 0001h
RXF7EIDH_RXF7EID9_SIZE                   equ 0001h
RXF7EIDH_RXF7EID9_LENGTH                 equ 0001h
RXF7EIDH_RXF7EID9_MASK                   equ 0002h
RXF7EIDH_RXF7EID10_POSN                  equ 0002h
RXF7EIDH_RXF7EID10_POSITION              equ 0002h
RXF7EIDH_RXF7EID10_SIZE                  equ 0001h
RXF7EIDH_RXF7EID10_LENGTH                equ 0001h
RXF7EIDH_RXF7EID10_MASK                  equ 0004h
RXF7EIDH_RXF7EID11_POSN                  equ 0003h
RXF7EIDH_RXF7EID11_POSITION              equ 0003h
RXF7EIDH_RXF7EID11_SIZE                  equ 0001h
RXF7EIDH_RXF7EID11_LENGTH                equ 0001h
RXF7EIDH_RXF7EID11_MASK                  equ 0008h
RXF7EIDH_RXF7EID12_POSN                  equ 0004h
RXF7EIDH_RXF7EID12_POSITION              equ 0004h
RXF7EIDH_RXF7EID12_SIZE                  equ 0001h
RXF7EIDH_RXF7EID12_LENGTH                equ 0001h
RXF7EIDH_RXF7EID12_MASK                  equ 0010h
RXF7EIDH_RXF7EID13_POSN                  equ 0005h
RXF7EIDH_RXF7EID13_POSITION              equ 0005h
RXF7EIDH_RXF7EID13_SIZE                  equ 0001h
RXF7EIDH_RXF7EID13_LENGTH                equ 0001h
RXF7EIDH_RXF7EID13_MASK                  equ 0020h
RXF7EIDH_RXF7EID14_POSN                  equ 0006h
RXF7EIDH_RXF7EID14_POSITION              equ 0006h
RXF7EIDH_RXF7EID14_SIZE                  equ 0001h
RXF7EIDH_RXF7EID14_LENGTH                equ 0001h
RXF7EIDH_RXF7EID14_MASK                  equ 0040h
RXF7EIDH_RXF7EID15_POSN                  equ 0007h
RXF7EIDH_RXF7EID15_POSITION              equ 0007h
RXF7EIDH_RXF7EID15_SIZE                  equ 0001h
RXF7EIDH_RXF7EID15_LENGTH                equ 0001h
RXF7EIDH_RXF7EID15_MASK                  equ 0080h

// Register: RXF7EIDL
#define RXF7EIDL RXF7EIDL
RXF7EIDL                                 equ 0D67h
// bitfield definitions
RXF7EIDL_EID0_POSN                       equ 0000h
RXF7EIDL_EID0_POSITION                   equ 0000h
RXF7EIDL_EID0_SIZE                       equ 0001h
RXF7EIDL_EID0_LENGTH                     equ 0001h
RXF7EIDL_EID0_MASK                       equ 0001h
RXF7EIDL_EID1_POSN                       equ 0001h
RXF7EIDL_EID1_POSITION                   equ 0001h
RXF7EIDL_EID1_SIZE                       equ 0001h
RXF7EIDL_EID1_LENGTH                     equ 0001h
RXF7EIDL_EID1_MASK                       equ 0002h
RXF7EIDL_EID2_POSN                       equ 0002h
RXF7EIDL_EID2_POSITION                   equ 0002h
RXF7EIDL_EID2_SIZE                       equ 0001h
RXF7EIDL_EID2_LENGTH                     equ 0001h
RXF7EIDL_EID2_MASK                       equ 0004h
RXF7EIDL_EID3_POSN                       equ 0003h
RXF7EIDL_EID3_POSITION                   equ 0003h
RXF7EIDL_EID3_SIZE                       equ 0001h
RXF7EIDL_EID3_LENGTH                     equ 0001h
RXF7EIDL_EID3_MASK                       equ 0008h
RXF7EIDL_EID4_POSN                       equ 0004h
RXF7EIDL_EID4_POSITION                   equ 0004h
RXF7EIDL_EID4_SIZE                       equ 0001h
RXF7EIDL_EID4_LENGTH                     equ 0001h
RXF7EIDL_EID4_MASK                       equ 0010h
RXF7EIDL_EID5_POSN                       equ 0005h
RXF7EIDL_EID5_POSITION                   equ 0005h
RXF7EIDL_EID5_SIZE                       equ 0001h
RXF7EIDL_EID5_LENGTH                     equ 0001h
RXF7EIDL_EID5_MASK                       equ 0020h
RXF7EIDL_EID6_POSN                       equ 0006h
RXF7EIDL_EID6_POSITION                   equ 0006h
RXF7EIDL_EID6_SIZE                       equ 0001h
RXF7EIDL_EID6_LENGTH                     equ 0001h
RXF7EIDL_EID6_MASK                       equ 0040h
RXF7EIDL_EID7_POSN                       equ 0007h
RXF7EIDL_EID7_POSITION                   equ 0007h
RXF7EIDL_EID7_SIZE                       equ 0001h
RXF7EIDL_EID7_LENGTH                     equ 0001h
RXF7EIDL_EID7_MASK                       equ 0080h
RXF7EIDL_RXF7EID0_POSN                   equ 0000h
RXF7EIDL_RXF7EID0_POSITION               equ 0000h
RXF7EIDL_RXF7EID0_SIZE                   equ 0001h
RXF7EIDL_RXF7EID0_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID0_MASK                   equ 0001h
RXF7EIDL_RXF7EID1_POSN                   equ 0001h
RXF7EIDL_RXF7EID1_POSITION               equ 0001h
RXF7EIDL_RXF7EID1_SIZE                   equ 0001h
RXF7EIDL_RXF7EID1_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID1_MASK                   equ 0002h
RXF7EIDL_RXF7EID2_POSN                   equ 0002h
RXF7EIDL_RXF7EID2_POSITION               equ 0002h
RXF7EIDL_RXF7EID2_SIZE                   equ 0001h
RXF7EIDL_RXF7EID2_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID2_MASK                   equ 0004h
RXF7EIDL_RXF7EID3_POSN                   equ 0003h
RXF7EIDL_RXF7EID3_POSITION               equ 0003h
RXF7EIDL_RXF7EID3_SIZE                   equ 0001h
RXF7EIDL_RXF7EID3_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID3_MASK                   equ 0008h
RXF7EIDL_RXF7EID4_POSN                   equ 0004h
RXF7EIDL_RXF7EID4_POSITION               equ 0004h
RXF7EIDL_RXF7EID4_SIZE                   equ 0001h
RXF7EIDL_RXF7EID4_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID4_MASK                   equ 0010h
RXF7EIDL_RXF7EID5_POSN                   equ 0005h
RXF7EIDL_RXF7EID5_POSITION               equ 0005h
RXF7EIDL_RXF7EID5_SIZE                   equ 0001h
RXF7EIDL_RXF7EID5_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID5_MASK                   equ 0020h
RXF7EIDL_RXF7EID6_POSN                   equ 0006h
RXF7EIDL_RXF7EID6_POSITION               equ 0006h
RXF7EIDL_RXF7EID6_SIZE                   equ 0001h
RXF7EIDL_RXF7EID6_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID6_MASK                   equ 0040h
RXF7EIDL_RXF7EID7_POSN                   equ 0007h
RXF7EIDL_RXF7EID7_POSITION               equ 0007h
RXF7EIDL_RXF7EID7_SIZE                   equ 0001h
RXF7EIDL_RXF7EID7_LENGTH                 equ 0001h
RXF7EIDL_RXF7EID7_MASK                   equ 0080h

// Register: RXF8SIDH
#define RXF8SIDH RXF8SIDH
RXF8SIDH                                 equ 0D68h
// bitfield definitions
RXF8SIDH_SID3_POSN                       equ 0000h
RXF8SIDH_SID3_POSITION                   equ 0000h
RXF8SIDH_SID3_SIZE                       equ 0001h
RXF8SIDH_SID3_LENGTH                     equ 0001h
RXF8SIDH_SID3_MASK                       equ 0001h
RXF8SIDH_SID4_POSN                       equ 0001h
RXF8SIDH_SID4_POSITION                   equ 0001h
RXF8SIDH_SID4_SIZE                       equ 0001h
RXF8SIDH_SID4_LENGTH                     equ 0001h
RXF8SIDH_SID4_MASK                       equ 0002h
RXF8SIDH_SID5_POSN                       equ 0002h
RXF8SIDH_SID5_POSITION                   equ 0002h
RXF8SIDH_SID5_SIZE                       equ 0001h
RXF8SIDH_SID5_LENGTH                     equ 0001h
RXF8SIDH_SID5_MASK                       equ 0004h
RXF8SIDH_SID6_POSN                       equ 0003h
RXF8SIDH_SID6_POSITION                   equ 0003h
RXF8SIDH_SID6_SIZE                       equ 0001h
RXF8SIDH_SID6_LENGTH                     equ 0001h
RXF8SIDH_SID6_MASK                       equ 0008h
RXF8SIDH_SID7_POSN                       equ 0004h
RXF8SIDH_SID7_POSITION                   equ 0004h
RXF8SIDH_SID7_SIZE                       equ 0001h
RXF8SIDH_SID7_LENGTH                     equ 0001h
RXF8SIDH_SID7_MASK                       equ 0010h
RXF8SIDH_SID8_POSN                       equ 0005h
RXF8SIDH_SID8_POSITION                   equ 0005h
RXF8SIDH_SID8_SIZE                       equ 0001h
RXF8SIDH_SID8_LENGTH                     equ 0001h
RXF8SIDH_SID8_MASK                       equ 0020h
RXF8SIDH_SID9_POSN                       equ 0006h
RXF8SIDH_SID9_POSITION                   equ 0006h
RXF8SIDH_SID9_SIZE                       equ 0001h
RXF8SIDH_SID9_LENGTH                     equ 0001h
RXF8SIDH_SID9_MASK                       equ 0040h
RXF8SIDH_SID10_POSN                      equ 0007h
RXF8SIDH_SID10_POSITION                  equ 0007h
RXF8SIDH_SID10_SIZE                      equ 0001h
RXF8SIDH_SID10_LENGTH                    equ 0001h
RXF8SIDH_SID10_MASK                      equ 0080h
RXF8SIDH_RXF8SID3_POSN                   equ 0000h
RXF8SIDH_RXF8SID3_POSITION               equ 0000h
RXF8SIDH_RXF8SID3_SIZE                   equ 0001h
RXF8SIDH_RXF8SID3_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID3_MASK                   equ 0001h
RXF8SIDH_RXF8SID4_POSN                   equ 0001h
RXF8SIDH_RXF8SID4_POSITION               equ 0001h
RXF8SIDH_RXF8SID4_SIZE                   equ 0001h
RXF8SIDH_RXF8SID4_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID4_MASK                   equ 0002h
RXF8SIDH_RXF8SID5_POSN                   equ 0002h
RXF8SIDH_RXF8SID5_POSITION               equ 0002h
RXF8SIDH_RXF8SID5_SIZE                   equ 0001h
RXF8SIDH_RXF8SID5_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID5_MASK                   equ 0004h
RXF8SIDH_RXF8SID6_POSN                   equ 0003h
RXF8SIDH_RXF8SID6_POSITION               equ 0003h
RXF8SIDH_RXF8SID6_SIZE                   equ 0001h
RXF8SIDH_RXF8SID6_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID6_MASK                   equ 0008h
RXF8SIDH_RXF8SID7_POSN                   equ 0004h
RXF8SIDH_RXF8SID7_POSITION               equ 0004h
RXF8SIDH_RXF8SID7_SIZE                   equ 0001h
RXF8SIDH_RXF8SID7_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID7_MASK                   equ 0010h
RXF8SIDH_RXF8SID8_POSN                   equ 0005h
RXF8SIDH_RXF8SID8_POSITION               equ 0005h
RXF8SIDH_RXF8SID8_SIZE                   equ 0001h
RXF8SIDH_RXF8SID8_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID8_MASK                   equ 0020h
RXF8SIDH_RXF8SID9_POSN                   equ 0006h
RXF8SIDH_RXF8SID9_POSITION               equ 0006h
RXF8SIDH_RXF8SID9_SIZE                   equ 0001h
RXF8SIDH_RXF8SID9_LENGTH                 equ 0001h
RXF8SIDH_RXF8SID9_MASK                   equ 0040h
RXF8SIDH_RXF8SID10_POSN                  equ 0007h
RXF8SIDH_RXF8SID10_POSITION              equ 0007h
RXF8SIDH_RXF8SID10_SIZE                  equ 0001h
RXF8SIDH_RXF8SID10_LENGTH                equ 0001h
RXF8SIDH_RXF8SID10_MASK                  equ 0080h

