GopalSaraf/Practicals/PSDL/include/proc/pic18f4480.inc
// Register: TXB2DLC
#define TXB2DLC TXB2DLC
TXB2DLC                                  equ 0F25h
// bitfield definitions
TXB2DLC_DLC0_POSN                        equ 0000h
TXB2DLC_DLC0_POSITION                    equ 0000h
TXB2DLC_DLC0_SIZE                        equ 0001h
TXB2DLC_DLC0_LENGTH                      equ 0001h
TXB2DLC_DLC0_MASK                        equ 0001h
TXB2DLC_DLC1_POSN                        equ 0001h
TXB2DLC_DLC1_POSITION                    equ 0001h
TXB2DLC_DLC1_SIZE                        equ 0001h
TXB2DLC_DLC1_LENGTH                      equ 0001h
TXB2DLC_DLC1_MASK                        equ 0002h
TXB2DLC_DLC2_POSN                        equ 0002h
TXB2DLC_DLC2_POSITION                    equ 0002h
TXB2DLC_DLC2_SIZE                        equ 0001h
TXB2DLC_DLC2_LENGTH                      equ 0001h
TXB2DLC_DLC2_MASK                        equ 0004h
TXB2DLC_DLC3_POSN                        equ 0003h
TXB2DLC_DLC3_POSITION                    equ 0003h
TXB2DLC_DLC3_SIZE                        equ 0001h
TXB2DLC_DLC3_LENGTH                      equ 0001h
TXB2DLC_DLC3_MASK                        equ 0008h
TXB2DLC_TXRTR_POSN                       equ 0006h
TXB2DLC_TXRTR_POSITION                   equ 0006h
TXB2DLC_TXRTR_SIZE                       equ 0001h
TXB2DLC_TXRTR_LENGTH                     equ 0001h
TXB2DLC_TXRTR_MASK                       equ 0040h
TXB2DLC_TXB2DLC0_POSN                    equ 0000h
TXB2DLC_TXB2DLC0_POSITION                equ 0000h
TXB2DLC_TXB2DLC0_SIZE                    equ 0001h
TXB2DLC_TXB2DLC0_LENGTH                  equ 0001h
TXB2DLC_TXB2DLC0_MASK                    equ 0001h
TXB2DLC_TXB2DLC1_POSN                    equ 0001h
TXB2DLC_TXB2DLC1_POSITION                equ 0001h
TXB2DLC_TXB2DLC1_SIZE                    equ 0001h
TXB2DLC_TXB2DLC1_LENGTH                  equ 0001h
TXB2DLC_TXB2DLC1_MASK                    equ 0002h
TXB2DLC_TXB2DLC2_POSN                    equ 0002h
TXB2DLC_TXB2DLC2_POSITION                equ 0002h
TXB2DLC_TXB2DLC2_SIZE                    equ 0001h
TXB2DLC_TXB2DLC2_LENGTH                  equ 0001h
TXB2DLC_TXB2DLC2_MASK                    equ 0004h
TXB2DLC_TXB2DLC3_POSN                    equ 0003h
TXB2DLC_TXB2DLC3_POSITION                equ 0003h
TXB2DLC_TXB2DLC3_SIZE                    equ 0001h
TXB2DLC_TXB2DLC3_LENGTH                  equ 0001h
TXB2DLC_TXB2DLC3_MASK                    equ 0008h
TXB2DLC_TXB2RTR_POSN                     equ 0006h
TXB2DLC_TXB2RTR_POSITION                 equ 0006h
TXB2DLC_TXB2RTR_SIZE                     equ 0001h
TXB2DLC_TXB2RTR_LENGTH                   equ 0001h
TXB2DLC_TXB2RTR_MASK                     equ 0040h

// Register: TXB2D0
#define TXB2D0 TXB2D0
TXB2D0                                   equ 0F26h
// bitfield definitions
TXB2D0_TXB2D00_POSN                      equ 0000h
TXB2D0_TXB2D00_POSITION                  equ 0000h
TXB2D0_TXB2D00_SIZE                      equ 0001h
TXB2D0_TXB2D00_LENGTH                    equ 0001h
TXB2D0_TXB2D00_MASK                      equ 0001h
TXB2D0_TXB2D01_POSN                      equ 0001h
TXB2D0_TXB2D01_POSITION                  equ 0001h
TXB2D0_TXB2D01_SIZE                      equ 0001h
TXB2D0_TXB2D01_LENGTH                    equ 0001h
TXB2D0_TXB2D01_MASK                      equ 0002h
TXB2D0_TXB2D02_POSN                      equ 0002h
TXB2D0_TXB2D02_POSITION                  equ 0002h
TXB2D0_TXB2D02_SIZE                      equ 0001h
TXB2D0_TXB2D02_LENGTH                    equ 0001h
TXB2D0_TXB2D02_MASK                      equ 0004h
TXB2D0_TXB2D03_POSN                      equ 0003h
TXB2D0_TXB2D03_POSITION                  equ 0003h
TXB2D0_TXB2D03_SIZE                      equ 0001h
TXB2D0_TXB2D03_LENGTH                    equ 0001h
TXB2D0_TXB2D03_MASK                      equ 0008h
TXB2D0_TXB2D04_POSN                      equ 0004h
TXB2D0_TXB2D04_POSITION                  equ 0004h
TXB2D0_TXB2D04_SIZE                      equ 0001h
TXB2D0_TXB2D04_LENGTH                    equ 0001h
TXB2D0_TXB2D04_MASK                      equ 0010h
TXB2D0_TXB2D05_POSN                      equ 0005h
TXB2D0_TXB2D05_POSITION                  equ 0005h
TXB2D0_TXB2D05_SIZE                      equ 0001h
TXB2D0_TXB2D05_LENGTH                    equ 0001h
TXB2D0_TXB2D05_MASK                      equ 0020h
TXB2D0_TXB2D06_POSN                      equ 0006h
TXB2D0_TXB2D06_POSITION                  equ 0006h
TXB2D0_TXB2D06_SIZE                      equ 0001h
TXB2D0_TXB2D06_LENGTH                    equ 0001h
TXB2D0_TXB2D06_MASK                      equ 0040h
TXB2D0_TXB2D07_POSN                      equ 0007h
TXB2D0_TXB2D07_POSITION                  equ 0007h
TXB2D0_TXB2D07_SIZE                      equ 0001h
TXB2D0_TXB2D07_LENGTH                    equ 0001h
TXB2D0_TXB2D07_MASK                      equ 0080h

// Register: TXB2D1
#define TXB2D1 TXB2D1
TXB2D1                                   equ 0F27h
// bitfield definitions
TXB2D1_TXB2D10_POSN                      equ 0000h
TXB2D1_TXB2D10_POSITION                  equ 0000h
TXB2D1_TXB2D10_SIZE                      equ 0001h
TXB2D1_TXB2D10_LENGTH                    equ 0001h
TXB2D1_TXB2D10_MASK                      equ 0001h
TXB2D1_TXB2D11_POSN                      equ 0001h
TXB2D1_TXB2D11_POSITION                  equ 0001h
TXB2D1_TXB2D11_SIZE                      equ 0001h
TXB2D1_TXB2D11_LENGTH                    equ 0001h
TXB2D1_TXB2D11_MASK                      equ 0002h
TXB2D1_TXB2D12_POSN                      equ 0002h
TXB2D1_TXB2D12_POSITION                  equ 0002h
TXB2D1_TXB2D12_SIZE                      equ 0001h
TXB2D1_TXB2D12_LENGTH                    equ 0001h
TXB2D1_TXB2D12_MASK                      equ 0004h
TXB2D1_TXB2D13_POSN                      equ 0003h
TXB2D1_TXB2D13_POSITION                  equ 0003h
TXB2D1_TXB2D13_SIZE                      equ 0001h
TXB2D1_TXB2D13_LENGTH                    equ 0001h
TXB2D1_TXB2D13_MASK                      equ 0008h
TXB2D1_TXB2D14_POSN                      equ 0004h
TXB2D1_TXB2D14_POSITION                  equ 0004h
TXB2D1_TXB2D14_SIZE                      equ 0001h
TXB2D1_TXB2D14_LENGTH                    equ 0001h
TXB2D1_TXB2D14_MASK                      equ 0010h
TXB2D1_TXB2D15_POSN                      equ 0005h
TXB2D1_TXB2D15_POSITION                  equ 0005h
TXB2D1_TXB2D15_SIZE                      equ 0001h
TXB2D1_TXB2D15_LENGTH                    equ 0001h
TXB2D1_TXB2D15_MASK                      equ 0020h
TXB2D1_TXB2D16_POSN                      equ 0006h
TXB2D1_TXB2D16_POSITION                  equ 0006h
TXB2D1_TXB2D16_SIZE                      equ 0001h
TXB2D1_TXB2D16_LENGTH                    equ 0001h
TXB2D1_TXB2D16_MASK                      equ 0040h
TXB2D1_TXB2D17_POSN                      equ 0007h
TXB2D1_TXB2D17_POSITION                  equ 0007h
TXB2D1_TXB2D17_SIZE                      equ 0001h
TXB2D1_TXB2D17_LENGTH                    equ 0001h
TXB2D1_TXB2D17_MASK                      equ 0080h

// Register: TXB2D2
#define TXB2D2 TXB2D2
TXB2D2                                   equ 0F28h
// bitfield definitions
TXB2D2_TXB2D20_POSN                      equ 0000h
TXB2D2_TXB2D20_POSITION                  equ 0000h
TXB2D2_TXB2D20_SIZE                      equ 0001h
TXB2D2_TXB2D20_LENGTH                    equ 0001h
TXB2D2_TXB2D20_MASK                      equ 0001h
TXB2D2_TXB2D21_POSN                      equ 0001h
TXB2D2_TXB2D21_POSITION                  equ 0001h
TXB2D2_TXB2D21_SIZE                      equ 0001h
TXB2D2_TXB2D21_LENGTH                    equ 0001h
TXB2D2_TXB2D21_MASK                      equ 0002h
TXB2D2_TXB2D22_POSN                      equ 0002h
TXB2D2_TXB2D22_POSITION                  equ 0002h
TXB2D2_TXB2D22_SIZE                      equ 0001h
TXB2D2_TXB2D22_LENGTH                    equ 0001h
TXB2D2_TXB2D22_MASK                      equ 0004h
TXB2D2_TXB2D23_POSN                      equ 0003h
TXB2D2_TXB2D23_POSITION                  equ 0003h
TXB2D2_TXB2D23_SIZE                      equ 0001h
TXB2D2_TXB2D23_LENGTH                    equ 0001h
TXB2D2_TXB2D23_MASK                      equ 0008h
TXB2D2_TXB2D24_POSN                      equ 0004h
TXB2D2_TXB2D24_POSITION                  equ 0004h
TXB2D2_TXB2D24_SIZE                      equ 0001h
TXB2D2_TXB2D24_LENGTH                    equ 0001h
TXB2D2_TXB2D24_MASK                      equ 0010h
TXB2D2_TXB2D25_POSN                      equ 0005h
TXB2D2_TXB2D25_POSITION                  equ 0005h
TXB2D2_TXB2D25_SIZE                      equ 0001h
TXB2D2_TXB2D25_LENGTH                    equ 0001h
TXB2D2_TXB2D25_MASK                      equ 0020h
TXB2D2_TXB2D26_POSN                      equ 0006h
TXB2D2_TXB2D26_POSITION                  equ 0006h
TXB2D2_TXB2D26_SIZE                      equ 0001h
TXB2D2_TXB2D26_LENGTH                    equ 0001h
TXB2D2_TXB2D26_MASK                      equ 0040h
TXB2D2_TXB2D27_POSN                      equ 0007h
TXB2D2_TXB2D27_POSITION                  equ 0007h
TXB2D2_TXB2D27_SIZE                      equ 0001h
TXB2D2_TXB2D27_LENGTH                    equ 0001h
TXB2D2_TXB2D27_MASK                      equ 0080h

