GopalSaraf/Practicals/PSDL/include/proc/pic18f4480.inc
// Register: TXB0D0
#define TXB0D0 TXB0D0
TXB0D0                                   equ 0F46h
// bitfield definitions
TXB0D0_TXB0D00_POSN                      equ 0000h
TXB0D0_TXB0D00_POSITION                  equ 0000h
TXB0D0_TXB0D00_SIZE                      equ 0001h
TXB0D0_TXB0D00_LENGTH                    equ 0001h
TXB0D0_TXB0D00_MASK                      equ 0001h
TXB0D0_TXB0D01_POSN                      equ 0001h
TXB0D0_TXB0D01_POSITION                  equ 0001h
TXB0D0_TXB0D01_SIZE                      equ 0001h
TXB0D0_TXB0D01_LENGTH                    equ 0001h
TXB0D0_TXB0D01_MASK                      equ 0002h
TXB0D0_TXB0D02_POSN                      equ 0002h
TXB0D0_TXB0D02_POSITION                  equ 0002h
TXB0D0_TXB0D02_SIZE                      equ 0001h
TXB0D0_TXB0D02_LENGTH                    equ 0001h
TXB0D0_TXB0D02_MASK                      equ 0004h
TXB0D0_TXB0D03_POSN                      equ 0003h
TXB0D0_TXB0D03_POSITION                  equ 0003h
TXB0D0_TXB0D03_SIZE                      equ 0001h
TXB0D0_TXB0D03_LENGTH                    equ 0001h
TXB0D0_TXB0D03_MASK                      equ 0008h
TXB0D0_TXB0D04_POSN                      equ 0004h
TXB0D0_TXB0D04_POSITION                  equ 0004h
TXB0D0_TXB0D04_SIZE                      equ 0001h
TXB0D0_TXB0D04_LENGTH                    equ 0001h
TXB0D0_TXB0D04_MASK                      equ 0010h
TXB0D0_TXB0D05_POSN                      equ 0005h
TXB0D0_TXB0D05_POSITION                  equ 0005h
TXB0D0_TXB0D05_SIZE                      equ 0001h
TXB0D0_TXB0D05_LENGTH                    equ 0001h
TXB0D0_TXB0D05_MASK                      equ 0020h
TXB0D0_TXB0D06_POSN                      equ 0006h
TXB0D0_TXB0D06_POSITION                  equ 0006h
TXB0D0_TXB0D06_SIZE                      equ 0001h
TXB0D0_TXB0D06_LENGTH                    equ 0001h
TXB0D0_TXB0D06_MASK                      equ 0040h
TXB0D0_TXB0D07_POSN                      equ 0007h
TXB0D0_TXB0D07_POSITION                  equ 0007h
TXB0D0_TXB0D07_SIZE                      equ 0001h
TXB0D0_TXB0D07_LENGTH                    equ 0001h
TXB0D0_TXB0D07_MASK                      equ 0080h

// Register: TXB0D1
#define TXB0D1 TXB0D1
TXB0D1                                   equ 0F47h
// bitfield definitions
TXB0D1_TXB0D10_POSN                      equ 0000h
TXB0D1_TXB0D10_POSITION                  equ 0000h
TXB0D1_TXB0D10_SIZE                      equ 0001h
TXB0D1_TXB0D10_LENGTH                    equ 0001h
TXB0D1_TXB0D10_MASK                      equ 0001h
TXB0D1_TXB0D11_POSN                      equ 0001h
TXB0D1_TXB0D11_POSITION                  equ 0001h
TXB0D1_TXB0D11_SIZE                      equ 0001h
TXB0D1_TXB0D11_LENGTH                    equ 0001h
TXB0D1_TXB0D11_MASK                      equ 0002h
TXB0D1_TXB0D12_POSN                      equ 0002h
TXB0D1_TXB0D12_POSITION                  equ 0002h
TXB0D1_TXB0D12_SIZE                      equ 0001h
TXB0D1_TXB0D12_LENGTH                    equ 0001h
TXB0D1_TXB0D12_MASK                      equ 0004h
TXB0D1_TXB0D13_POSN                      equ 0003h
TXB0D1_TXB0D13_POSITION                  equ 0003h
TXB0D1_TXB0D13_SIZE                      equ 0001h
TXB0D1_TXB0D13_LENGTH                    equ 0001h
TXB0D1_TXB0D13_MASK                      equ 0008h
TXB0D1_TXB0D14_POSN                      equ 0004h
TXB0D1_TXB0D14_POSITION                  equ 0004h
TXB0D1_TXB0D14_SIZE                      equ 0001h
TXB0D1_TXB0D14_LENGTH                    equ 0001h
TXB0D1_TXB0D14_MASK                      equ 0010h
TXB0D1_TXB0D15_POSN                      equ 0005h
TXB0D1_TXB0D15_POSITION                  equ 0005h
TXB0D1_TXB0D15_SIZE                      equ 0001h
TXB0D1_TXB0D15_LENGTH                    equ 0001h
TXB0D1_TXB0D15_MASK                      equ 0020h
TXB0D1_TXB0D16_POSN                      equ 0006h
TXB0D1_TXB0D16_POSITION                  equ 0006h
TXB0D1_TXB0D16_SIZE                      equ 0001h
TXB0D1_TXB0D16_LENGTH                    equ 0001h
TXB0D1_TXB0D16_MASK                      equ 0040h
TXB0D1_TXB0D17_POSN                      equ 0007h
TXB0D1_TXB0D17_POSITION                  equ 0007h
TXB0D1_TXB0D17_SIZE                      equ 0001h
TXB0D1_TXB0D17_LENGTH                    equ 0001h
TXB0D1_TXB0D17_MASK                      equ 0080h

// Register: TXB0D2
#define TXB0D2 TXB0D2
TXB0D2                                   equ 0F48h
// bitfield definitions
TXB0D2_TXB0D20_POSN                      equ 0000h
TXB0D2_TXB0D20_POSITION                  equ 0000h
TXB0D2_TXB0D20_SIZE                      equ 0001h
TXB0D2_TXB0D20_LENGTH                    equ 0001h
TXB0D2_TXB0D20_MASK                      equ 0001h
TXB0D2_TXB0D21_POSN                      equ 0001h
TXB0D2_TXB0D21_POSITION                  equ 0001h
TXB0D2_TXB0D21_SIZE                      equ 0001h
TXB0D2_TXB0D21_LENGTH                    equ 0001h
TXB0D2_TXB0D21_MASK                      equ 0002h
TXB0D2_TXB0D22_POSN                      equ 0002h
TXB0D2_TXB0D22_POSITION                  equ 0002h
TXB0D2_TXB0D22_SIZE                      equ 0001h
TXB0D2_TXB0D22_LENGTH                    equ 0001h
TXB0D2_TXB0D22_MASK                      equ 0004h
TXB0D2_TXB0D23_POSN                      equ 0003h
TXB0D2_TXB0D23_POSITION                  equ 0003h
TXB0D2_TXB0D23_SIZE                      equ 0001h
TXB0D2_TXB0D23_LENGTH                    equ 0001h
TXB0D2_TXB0D23_MASK                      equ 0008h
TXB0D2_TXB0D24_POSN                      equ 0004h
TXB0D2_TXB0D24_POSITION                  equ 0004h
TXB0D2_TXB0D24_SIZE                      equ 0001h
TXB0D2_TXB0D24_LENGTH                    equ 0001h
TXB0D2_TXB0D24_MASK                      equ 0010h
TXB0D2_TXB0D25_POSN                      equ 0005h
TXB0D2_TXB0D25_POSITION                  equ 0005h
TXB0D2_TXB0D25_SIZE                      equ 0001h
TXB0D2_TXB0D25_LENGTH                    equ 0001h
TXB0D2_TXB0D25_MASK                      equ 0020h
TXB0D2_TXB0D26_POSN                      equ 0006h
TXB0D2_TXB0D26_POSITION                  equ 0006h
TXB0D2_TXB0D26_SIZE                      equ 0001h
TXB0D2_TXB0D26_LENGTH                    equ 0001h
TXB0D2_TXB0D26_MASK                      equ 0040h
TXB0D2_TXB0D27_POSN                      equ 0007h
TXB0D2_TXB0D27_POSITION                  equ 0007h
TXB0D2_TXB0D27_SIZE                      equ 0001h
TXB0D2_TXB0D27_LENGTH                    equ 0001h
TXB0D2_TXB0D27_MASK                      equ 0080h

// Register: TXB0D3
#define TXB0D3 TXB0D3
TXB0D3                                   equ 0F49h
// bitfield definitions
TXB0D3_TXB0D30_POSN                      equ 0000h
TXB0D3_TXB0D30_POSITION                  equ 0000h
TXB0D3_TXB0D30_SIZE                      equ 0001h
TXB0D3_TXB0D30_LENGTH                    equ 0001h
TXB0D3_TXB0D30_MASK                      equ 0001h
TXB0D3_TXB0D31_POSN                      equ 0001h
TXB0D3_TXB0D31_POSITION                  equ 0001h
TXB0D3_TXB0D31_SIZE                      equ 0001h
TXB0D3_TXB0D31_LENGTH                    equ 0001h
TXB0D3_TXB0D31_MASK                      equ 0002h
TXB0D3_TXB0D32_POSN                      equ 0002h
TXB0D3_TXB0D32_POSITION                  equ 0002h
TXB0D3_TXB0D32_SIZE                      equ 0001h
TXB0D3_TXB0D32_LENGTH                    equ 0001h
TXB0D3_TXB0D32_MASK                      equ 0004h
TXB0D3_TXB0D33_POSN                      equ 0003h
TXB0D3_TXB0D33_POSITION                  equ 0003h
TXB0D3_TXB0D33_SIZE                      equ 0001h
TXB0D3_TXB0D33_LENGTH                    equ 0001h
TXB0D3_TXB0D33_MASK                      equ 0008h
TXB0D3_TXB0D34_POSN                      equ 0004h
TXB0D3_TXB0D34_POSITION                  equ 0004h
TXB0D3_TXB0D34_SIZE                      equ 0001h
TXB0D3_TXB0D34_LENGTH                    equ 0001h
TXB0D3_TXB0D34_MASK                      equ 0010h
TXB0D3_TXB0D35_POSN                      equ 0005h
TXB0D3_TXB0D35_POSITION                  equ 0005h
TXB0D3_TXB0D35_SIZE                      equ 0001h
TXB0D3_TXB0D35_LENGTH                    equ 0001h
TXB0D3_TXB0D35_MASK                      equ 0020h
TXB0D3_TXB0D36_POSN                      equ 0006h
TXB0D3_TXB0D36_POSITION                  equ 0006h
TXB0D3_TXB0D36_SIZE                      equ 0001h
TXB0D3_TXB0D36_LENGTH                    equ 0001h
TXB0D3_TXB0D36_MASK                      equ 0040h
TXB0D3_TXB0D37_POSN                      equ 0007h
TXB0D3_TXB0D37_POSITION                  equ 0007h
TXB0D3_TXB0D37_SIZE                      equ 0001h
TXB0D3_TXB0D37_LENGTH                    equ 0001h
TXB0D3_TXB0D37_MASK                      equ 0080h

// Register: TXB0D4
#define TXB0D4 TXB0D4
TXB0D4                                   equ 0F4Ah
// bitfield definitions
TXB0D4_TXB0D40_POSN                      equ 0000h
TXB0D4_TXB0D40_POSITION                  equ 0000h
TXB0D4_TXB0D40_SIZE                      equ 0001h
TXB0D4_TXB0D40_LENGTH                    equ 0001h
TXB0D4_TXB0D40_MASK                      equ 0001h
TXB0D4_TXB0D41_POSN                      equ 0001h
TXB0D4_TXB0D41_POSITION                  equ 0001h
TXB0D4_TXB0D41_SIZE                      equ 0001h
TXB0D4_TXB0D41_LENGTH                    equ 0001h
TXB0D4_TXB0D41_MASK                      equ 0002h
TXB0D4_TXB0D42_POSN                      equ 0002h
TXB0D4_TXB0D42_POSITION                  equ 0002h
TXB0D4_TXB0D42_SIZE                      equ 0001h
TXB0D4_TXB0D42_LENGTH                    equ 0001h
TXB0D4_TXB0D42_MASK                      equ 0004h
TXB0D4_TXB0D43_POSN                      equ 0003h
TXB0D4_TXB0D43_POSITION                  equ 0003h
TXB0D4_TXB0D43_SIZE                      equ 0001h
TXB0D4_TXB0D43_LENGTH                    equ 0001h
TXB0D4_TXB0D43_MASK                      equ 0008h
TXB0D4_TXB0D44_POSN                      equ 0004h
TXB0D4_TXB0D44_POSITION                  equ 0004h
TXB0D4_TXB0D44_SIZE                      equ 0001h
TXB0D4_TXB0D44_LENGTH                    equ 0001h
TXB0D4_TXB0D44_MASK                      equ 0010h
TXB0D4_TXB0D45_POSN                      equ 0005h
TXB0D4_TXB0D45_POSITION                  equ 0005h
TXB0D4_TXB0D45_SIZE                      equ 0001h
TXB0D4_TXB0D45_LENGTH                    equ 0001h
TXB0D4_TXB0D45_MASK                      equ 0020h
TXB0D4_TXB0D46_POSN                      equ 0006h
TXB0D4_TXB0D46_POSITION                  equ 0006h
TXB0D4_TXB0D46_SIZE                      equ 0001h
TXB0D4_TXB0D46_LENGTH                    equ 0001h
TXB0D4_TXB0D46_MASK                      equ 0040h
TXB0D4_TXB0D47_POSN                      equ 0007h
TXB0D4_TXB0D47_POSITION                  equ 0007h
TXB0D4_TXB0D47_SIZE                      equ 0001h
TXB0D4_TXB0D47_LENGTH                    equ 0001h
TXB0D4_TXB0D47_MASK                      equ 0080h

// Register: TXB0D5
#define TXB0D5 TXB0D5
TXB0D5                                   equ 0F4Bh
// bitfield definitions
TXB0D5_TXB0D50_POSN                      equ 0000h
TXB0D5_TXB0D50_POSITION                  equ 0000h
TXB0D5_TXB0D50_SIZE                      equ 0001h
TXB0D5_TXB0D50_LENGTH                    equ 0001h
TXB0D5_TXB0D50_MASK                      equ 0001h
TXB0D5_TXB0D51_POSN                      equ 0001h
TXB0D5_TXB0D51_POSITION                  equ 0001h
TXB0D5_TXB0D51_SIZE                      equ 0001h
TXB0D5_TXB0D51_LENGTH                    equ 0001h
TXB0D5_TXB0D51_MASK                      equ 0002h
TXB0D5_TXB0D52_POSN                      equ 0002h
TXB0D5_TXB0D52_POSITION                  equ 0002h
TXB0D5_TXB0D52_SIZE                      equ 0001h
TXB0D5_TXB0D52_LENGTH                    equ 0001h
TXB0D5_TXB0D52_MASK                      equ 0004h
TXB0D5_TXB0D53_POSN                      equ 0003h
TXB0D5_TXB0D53_POSITION                  equ 0003h
TXB0D5_TXB0D53_SIZE                      equ 0001h
TXB0D5_TXB0D53_LENGTH                    equ 0001h
TXB0D5_TXB0D53_MASK                      equ 0008h
TXB0D5_TXB0D54_POSN                      equ 0004h
TXB0D5_TXB0D54_POSITION                  equ 0004h
TXB0D5_TXB0D54_SIZE                      equ 0001h
TXB0D5_TXB0D54_LENGTH                    equ 0001h
TXB0D5_TXB0D54_MASK                      equ 0010h
TXB0D5_TXB0D55_POSN                      equ 0005h
TXB0D5_TXB0D55_POSITION                  equ 0005h
TXB0D5_TXB0D55_SIZE                      equ 0001h
TXB0D5_TXB0D55_LENGTH                    equ 0001h
TXB0D5_TXB0D55_MASK                      equ 0020h
TXB0D5_TXB0D56_POSN                      equ 0006h
TXB0D5_TXB0D56_POSITION                  equ 0006h
TXB0D5_TXB0D56_SIZE                      equ 0001h
TXB0D5_TXB0D56_LENGTH                    equ 0001h
TXB0D5_TXB0D56_MASK                      equ 0040h
TXB0D5_TXB0D57_POSN                      equ 0007h
TXB0D5_TXB0D57_POSITION                  equ 0007h
TXB0D5_TXB0D57_SIZE                      equ 0001h
TXB0D5_TXB0D57_LENGTH                    equ 0001h
TXB0D5_TXB0D57_MASK                      equ 0080h

// Register: TXB0D6
#define TXB0D6 TXB0D6
TXB0D6                                   equ 0F4Ch
// bitfield definitions
TXB0D6_TXB0D60_POSN                      equ 0000h
TXB0D6_TXB0D60_POSITION                  equ 0000h
TXB0D6_TXB0D60_SIZE                      equ 0001h
TXB0D6_TXB0D60_LENGTH                    equ 0001h
TXB0D6_TXB0D60_MASK                      equ 0001h
TXB0D6_TXB0D61_POSN                      equ 0001h
TXB0D6_TXB0D61_POSITION                  equ 0001h
TXB0D6_TXB0D61_SIZE                      equ 0001h
TXB0D6_TXB0D61_LENGTH                    equ 0001h
TXB0D6_TXB0D61_MASK                      equ 0002h
TXB0D6_TXB0D62_POSN                      equ 0002h
TXB0D6_TXB0D62_POSITION                  equ 0002h
TXB0D6_TXB0D62_SIZE                      equ 0001h
TXB0D6_TXB0D62_LENGTH                    equ 0001h
TXB0D6_TXB0D62_MASK                      equ 0004h
TXB0D6_TXB0D63_POSN                      equ 0003h
TXB0D6_TXB0D63_POSITION                  equ 0003h
TXB0D6_TXB0D63_SIZE                      equ 0001h
TXB0D6_TXB0D63_LENGTH                    equ 0001h
TXB0D6_TXB0D63_MASK                      equ 0008h
TXB0D6_TXB0D64_POSN                      equ 0004h
TXB0D6_TXB0D64_POSITION                  equ 0004h
TXB0D6_TXB0D64_SIZE                      equ 0001h
TXB0D6_TXB0D64_LENGTH                    equ 0001h
TXB0D6_TXB0D64_MASK                      equ 0010h
TXB0D6_TXB0D65_POSN                      equ 0005h
TXB0D6_TXB0D65_POSITION                  equ 0005h
TXB0D6_TXB0D65_SIZE                      equ 0001h
TXB0D6_TXB0D65_LENGTH                    equ 0001h
TXB0D6_TXB0D65_MASK                      equ 0020h
TXB0D6_TXB0D66_POSN                      equ 0006h
TXB0D6_TXB0D66_POSITION                  equ 0006h
TXB0D6_TXB0D66_SIZE                      equ 0001h
TXB0D6_TXB0D66_LENGTH                    equ 0001h
TXB0D6_TXB0D66_MASK                      equ 0040h
TXB0D6_TXB0D67_POSN                      equ 0007h
TXB0D6_TXB0D67_POSITION                  equ 0007h
TXB0D6_TXB0D67_SIZE                      equ 0001h
TXB0D6_TXB0D67_LENGTH                    equ 0001h
TXB0D6_TXB0D67_MASK                      equ 0080h

// Register: TXB0D7
#define TXB0D7 TXB0D7
TXB0D7                                   equ 0F4Dh
// bitfield definitions
TXB0D7_TXB0D70_POSN                      equ 0000h
TXB0D7_TXB0D70_POSITION                  equ 0000h
TXB0D7_TXB0D70_SIZE                      equ 0001h
TXB0D7_TXB0D70_LENGTH                    equ 0001h
TXB0D7_TXB0D70_MASK                      equ 0001h
TXB0D7_TXB0D71_POSN                      equ 0001h
TXB0D7_TXB0D71_POSITION                  equ 0001h
TXB0D7_TXB0D71_SIZE                      equ 0001h
TXB0D7_TXB0D71_LENGTH                    equ 0001h
TXB0D7_TXB0D71_MASK                      equ 0002h
TXB0D7_TXB0D72_POSN                      equ 0002h
TXB0D7_TXB0D72_POSITION                  equ 0002h
TXB0D7_TXB0D72_SIZE                      equ 0001h
TXB0D7_TXB0D72_LENGTH                    equ 0001h
TXB0D7_TXB0D72_MASK                      equ 0004h
TXB0D7_TXB0D73_POSN                      equ 0003h
TXB0D7_TXB0D73_POSITION                  equ 0003h
TXB0D7_TXB0D73_SIZE                      equ 0001h
TXB0D7_TXB0D73_LENGTH                    equ 0001h
TXB0D7_TXB0D73_MASK                      equ 0008h
TXB0D7_TXB0D74_POSN                      equ 0004h
TXB0D7_TXB0D74_POSITION                  equ 0004h
TXB0D7_TXB0D74_SIZE                      equ 0001h
TXB0D7_TXB0D74_LENGTH                    equ 0001h
TXB0D7_TXB0D74_MASK                      equ 0010h
TXB0D7_TXB0D75_POSN                      equ 0005h
TXB0D7_TXB0D75_POSITION                  equ 0005h
TXB0D7_TXB0D75_SIZE                      equ 0001h
TXB0D7_TXB0D75_LENGTH                    equ 0001h
TXB0D7_TXB0D75_MASK                      equ 0020h
TXB0D7_TXB0D76_POSN                      equ 0006h
TXB0D7_TXB0D76_POSITION                  equ 0006h
TXB0D7_TXB0D76_SIZE                      equ 0001h
TXB0D7_TXB0D76_LENGTH                    equ 0001h
TXB0D7_TXB0D76_MASK                      equ 0040h
TXB0D7_TXB0D77_POSN                      equ 0007h
TXB0D7_TXB0D77_POSITION                  equ 0007h
TXB0D7_TXB0D77_SIZE                      equ 0001h
TXB0D7_TXB0D77_LENGTH                    equ 0001h
TXB0D7_TXB0D77_MASK                      equ 0080h

