GopalSaraf/Practicals/PSDL/include/proc/pic18f4480.inc
#define B5EID6                           BANKMASK(B5EIDL), 6, b
#define B5EID7                           BANKMASK(B5EIDL), 7, b
#define B5EID8                           BANKMASK(B5EIDH), 0, b
#define B5EID9                           BANKMASK(B5EIDH), 1, b
#define B5EXID                           BANKMASK(B5SIDL), 3, b
#define B5EXIDE                          BANKMASK(B5SIDL), 3, b
#define B5FILHIT0                        BANKMASK(B5CON), 0, b
#define B5FILHIT1                        BANKMASK(B5CON), 1, b
#define B5FILHIT2                        BANKMASK(B5CON), 2, b
#define B5FILHIT3                        BANKMASK(B5CON), 3, b
#define B5FILHIT4                        BANKMASK(B5CON), 4, b
#define B5IE                             BANKMASK(BIE0), 7, b
#define B5RB0                            BANKMASK(B5DLC), 4, b
#define B5RB1                            BANKMASK(B5DLC), 5, b
#define B5RTREN                          BANKMASK(B5CON), 2, b
#define B5RTRRO                          BANKMASK(B5CON), 5, b
#define B5RXFUL                          BANKMASK(B5CON), 7, b
#define B5RXM1                           BANKMASK(B5CON), 6, b
#define B5RXRTR                          BANKMASK(B5DLC), 6, b
#define B5SID0                           BANKMASK(B5SIDL), 5, b
#define B5SID1                           BANKMASK(B5SIDL), 6, b
#define B5SID10                          BANKMASK(B5SIDH), 7, b
#define B5SID2                           BANKMASK(B5SIDL), 7, b
#define B5SID3                           BANKMASK(B5SIDH), 0, b
#define B5SID4                           BANKMASK(B5SIDH), 1, b
#define B5SID5                           BANKMASK(B5SIDH), 2, b
#define B5SID6                           BANKMASK(B5SIDH), 3, b
#define B5SID7                           BANKMASK(B5SIDH), 4, b
#define B5SID8                           BANKMASK(B5SIDH), 5, b
#define B5SID9                           BANKMASK(B5SIDH), 6, b
#define B5SRR                            BANKMASK(B5SIDL), 4, b
#define B5TXABT                          BANKMASK(B5CON), 6, b
#define B5TXBIF                          BANKMASK(B5CON), 7, b
#define B5TXEN                           BANKMASK(BSEL0), 7, b
#define B5TXERR                          BANKMASK(B5CON), 4, b
#define B5TXLARB                         BANKMASK(B5CON), 5, b
#define B5TXPRI0                         BANKMASK(B5CON), 0, b
#define B5TXPRI1                         BANKMASK(B5CON), 1, b
#define B5TXREQ                          BANKMASK(B5CON), 3, b
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSPSTAT), 0, a
#define BGST                             BANKMASK(HLVDCON), 5, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG16                            BANKMASK(BAUDCON), 3, a
#define BRGH                             BANKMASK(TXSTA), 2, a
#define BRGH1                            BANKMASK(TXSTA), 2, a
#define BRP0                             BANKMASK(BRGCON1), 0, a
#define BRP1                             BANKMASK(BRGCON1), 1, a
#define BRP2                             BANKMASK(BRGCON1), 2, a
#define BRP3                             BANKMASK(BRGCON1), 3, a
#define BRP4                             BANKMASK(BRGCON1), 4, a
#define BRP5                             BANKMASK(BRGCON1), 5, a
#define C1INA                            BANKMASK(PORTD), 1, a
#define C1INB                            BANKMASK(PORTD), 0, a
#define C1INV                            BANKMASK(CMCON), 4, a
#define C1OUT                            BANKMASK(CMCON), 6, a
#define C2INA                            BANKMASK(PORTD), 3, a
#define C2INB                            BANKMASK(PORTD), 2, a
#define C2INV                            BANKMASK(CMCON), 5, a
#define C2OUT                            BANKMASK(CMCON), 7, a
#define CANCAP                           BANKMASK(CIOCON), 4, a
#define CANRX                            BANKMASK(PORTB), 3, a
#define CANTX                            BANKMASK(PORTB), 2, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CIS                              BANKMASK(CMCON), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CKE                              BANKMASK(SSPSTAT), 6, a
#define CKP                              BANKMASK(SSPCON1), 4, a
#define CLKI                             BANKMASK(PORTA), 7, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CM0                              BANKMASK(CMCON), 0, a
#define CM1                              BANKMASK(CMCON), 1, a
#define CM2                              BANKMASK(CMCON), 2, a
#define CMEN0                            BANKMASK(CMCON), 0, a
#define CMEN1                            BANKMASK(CMCON), 1, a
#define CMEN2                            BANKMASK(CMCON), 2, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CREN                             BANKMASK(RCSTA), 4, a
#define CS                               BANKMASK(PORTE), 2, a
#define CSRC                             BANKMASK(TXSTA), 7, a
#define CSRC1                            BANKMASK(TXSTA), 7, a
#define CVR0                             BANKMASK(CVRCON), 0, a
#define CVR1                             BANKMASK(CVRCON), 1, a
#define CVR2                             BANKMASK(CVRCON), 2, a
#define CVR3                             BANKMASK(CVRCON), 3, a
#define CVREFA                           BANKMASK(PORTA), 0, a
#define CVREN                            BANKMASK(CVRCON), 7, a
#define CVROE                            BANKMASK(CVRCON), 6, a
#define CVROEN                           BANKMASK(CVRCON), 6, a
#define CVRR                             BANKMASK(CVRCON), 5, a
#define CVRSS                            BANKMASK(CVRCON), 4, a
#define DA                               BANKMASK(SSPSTAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DFLC0                            BANKMASK(SDFLC), 0, b
#define DFLC1                            BANKMASK(SDFLC), 1, b
#define DFLC2                            BANKMASK(SDFLC), 2, b
#define DFLC3                            BANKMASK(SDFLC), 3, b
#define DFLC4                            BANKMASK(SDFLC), 4, b
#define DONE                             BANKMASK(ADCON0), 1, a
#define DRXB0IE                          BANKMASK(BIE0), 0, b
#define DRXB1IE                          BANKMASK(BIE0), 1, b
#define DT                               BANKMASK(PORTC), 7, a
#define D_A                              BANKMASK(SSPSTAT), 5, a
#define D_NOT_A                          BANKMASK(SSPSTAT), 5, a
#define D_nA                             BANKMASK(SSPSTAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCP1                            BANKMASK(PORTD), 4, a
#define ECCP1IE                          BANKMASK(PIE2), 0, a
#define ECCP1IF                          BANKMASK(PIR2), 0, a
#define ECCP1IP                          BANKMASK(IPR2), 0, a
#define ECCP1M0                          BANKMASK(ECCP1CON), 0, a
#define ECCP1M1                          BANKMASK(ECCP1CON), 1, a
#define ECCP1M2                          BANKMASK(ECCP1CON), 2, a
#define ECCP1M3                          BANKMASK(ECCP1CON), 3, a
#define ECCPAS0                          BANKMASK(ECCP1AS), 4, a
#define ECCPAS1                          BANKMASK(ECCP1AS), 5, a
#define ECCPAS2                          BANKMASK(ECCP1AS), 6, a
#define ECCPASE                          BANKMASK(ECCP1AS), 7, a
#define EDC1B0                           BANKMASK(ECCP1CON), 4, a
#define EDC1B1                           BANKMASK(ECCP1CON), 5, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EICODE0                          BANKMASK(CANSTAT), 0, a
#define EICODE1                          BANKMASK(CANSTAT), 1, a
#define EICODE2                          BANKMASK(CANSTAT), 2, a
#define EICODE3                          BANKMASK(CANSTAT), 3, a
#define EICODE4                          BANKMASK(CANSTAT), 4, a
#define ENDRHI                           BANKMASK(CIOCON), 5, a
#define EPWM1M0                          BANKMASK(ECCP1CON), 6, a
#define EPWM1M1                          BANKMASK(ECCP1CON), 7, a
#define ERRIE                            BANKMASK(PIE3), 5, a
#define ERRIF                            BANKMASK(PIR3), 5, a
#define ERRIP                            BANKMASK(IPR3), 5, a
#define EWARN                            BANKMASK(COMSTAT), 0, a
#define EWIN0                            BANKMASK(ECANCON), 0, a
#define EWIN1                            BANKMASK(ECANCON), 1, a
#define EWIN2                            BANKMASK(ECANCON), 2, a
#define EWIN3                            BANKMASK(ECANCON), 3, a
#define EWIN4                            BANKMASK(ECANCON), 4, a
#define F0BP_0                           BANKMASK(RXFBCON0), 0, b
#define F0BP_01                          BANKMASK(RXFBCON0), 0, b
#define F0BP_1                           BANKMASK(RXFBCON0), 1, b
#define F0BP_2                           BANKMASK(RXFBCON0), 2, b
#define F0BP_3                           BANKMASK(RXFBCON0), 3, b
#define F10BP_0                          BANKMASK(RXFBCON5), 0, b
#define F10BP_01                         BANKMASK(RXFBCON5), 0, b
#define F10BP_1                          BANKMASK(RXFBCON5), 1, b
#define F10BP_2                          BANKMASK(RXFBCON5), 2, b
#define F10BP_3                          BANKMASK(RXFBCON5), 3, b
#define F11BP_0                          BANKMASK(RXFBCON5), 4, b
#define F11BP_1                          BANKMASK(RXFBCON5), 5, b
#define F11BP_2                          BANKMASK(RXFBCON5), 6, b
#define F11BP_3                          BANKMASK(RXFBCON5), 7, b
#define F12BP_0                          BANKMASK(RXFBCON6), 0, b
#define F12BP_01                         BANKMASK(RXFBCON6), 0, b
#define F12BP_1                          BANKMASK(RXFBCON6), 1, b
#define F12BP_2                          BANKMASK(RXFBCON6), 2, b
#define F12BP_3                          BANKMASK(RXFBCON6), 3, b
#define F13BP_0                          BANKMASK(RXFBCON6), 4, b
#define F13BP_1                          BANKMASK(RXFBCON6), 5, b
#define F13BP_2                          BANKMASK(RXFBCON6), 6, b
#define F13BP_3                          BANKMASK(RXFBCON6), 7, b
#define F14BP_0                          BANKMASK(RXFBCON7), 0, b
#define F14BP_01                         BANKMASK(RXFBCON7), 0, b
#define F14BP_1                          BANKMASK(RXFBCON7), 1, b
#define F14BP_2                          BANKMASK(RXFBCON7), 2, b
#define F14BP_3                          BANKMASK(RXFBCON7), 3, b
#define F15BP_0                          BANKMASK(RXFBCON7), 4, b
#define F15BP_1                          BANKMASK(RXFBCON7), 5, b
#define F15BP_2                          BANKMASK(RXFBCON7), 6, b
#define F15BP_3                          BANKMASK(RXFBCON7), 7, b
#define F1BP_0                           BANKMASK(RXFBCON0), 4, b
#define F1BP_1                           BANKMASK(RXFBCON0), 5, b
#define F1BP_2                           BANKMASK(RXFBCON0), 6, b
#define F1BP_3                           BANKMASK(RXFBCON0), 7, b
#define F2BP_0                           BANKMASK(RXFBCON1), 0, b
#define F2BP_01                          BANKMASK(RXFBCON1), 0, b
#define F2BP_1                           BANKMASK(RXFBCON1), 1, b
#define F2BP_2                           BANKMASK(RXFBCON1), 2, b
#define F2BP_3                           BANKMASK(RXFBCON1), 3, b
#define F3BP_0                           BANKMASK(RXFBCON1), 4, b
#define F3BP_1                           BANKMASK(RXFBCON1), 5, b
#define F3BP_2                           BANKMASK(RXFBCON1), 6, b
#define F3BP_3                           BANKMASK(RXFBCON1), 7, b
#define F4BP_0                           BANKMASK(RXFBCON2), 0, b
#define F4BP_01                          BANKMASK(RXFBCON2), 0, b
#define F4BP_1                           BANKMASK(RXFBCON2), 1, b
#define F4BP_2                           BANKMASK(RXFBCON2), 2, b
#define F4BP_3                           BANKMASK(RXFBCON2), 3, b
#define F5BP_0                           BANKMASK(RXFBCON2), 4, b
#define F5BP_1                           BANKMASK(RXFBCON2), 5, b
#define F5BP_2                           BANKMASK(RXFBCON2), 6, b
#define F5BP_3                           BANKMASK(RXFBCON2), 7, b
#define F6BP_0                           BANKMASK(RXFBCON3), 0, b
#define F6BP_01                          BANKMASK(RXFBCON3), 0, b
#define F6BP_1                           BANKMASK(RXFBCON3), 1, b
#define F6BP_2                           BANKMASK(RXFBCON3), 2, b
#define F6BP_3                           BANKMASK(RXFBCON3), 3, b
#define F7BP_0                           BANKMASK(RXFBCON3), 4, b
#define F7BP_1                           BANKMASK(RXFBCON3), 5, b
#define F7BP_2                           BANKMASK(RXFBCON3), 6, b
#define F7BP_3                           BANKMASK(RXFBCON3), 7, b
#define F8BP_0                           BANKMASK(RXFBCON4), 0, b
#define F8BP_01                          BANKMASK(RXFBCON4), 0, b
#define F8BP_1                           BANKMASK(RXFBCON4), 1, b
#define F8BP_2                           BANKMASK(RXFBCON4), 2, b
#define F8BP_3                           BANKMASK(RXFBCON4), 3, b
#define F9BP_0                           BANKMASK(RXFBCON4), 4, b
#define F9BP_1                           BANKMASK(RXFBCON4), 5, b
#define F9BP_2                           BANKMASK(RXFBCON4), 6, b
#define F9BP_3                           BANKMASK(RXFBCON4), 7, b
#define FERR                             BANKMASK(RCSTA), 2, a
#define FIFOEMPTY                        BANKMASK(COMSTAT), 7, a
#define FIFOMWIE                         BANKMASK(PIE3), 0, a
#define FIFOWM                           BANKMASK(ECANCON), 5, a
#define FIFOWMIE                         BANKMASK(PIE3), 0, a
#define FIFOWMIF                         BANKMASK(PIR3), 0, a
#define FIFOWMIP                         BANKMASK(IPR3), 0, a
#define FIL0_0                           BANKMASK(MSEL0), 0, b
#define FIL0_1                           BANKMASK(MSEL0), 1, b
#define FIL10_0                          BANKMASK(MSEL2), 4, b
#define FIL10_1                          BANKMASK(MSEL2), 5, b
#define FIL11_0                          BANKMASK(MSEL2), 6, b
#define FIL11_1                          BANKMASK(MSEL2), 7, b
#define FIL12_0                          BANKMASK(MSEL3), 0, b
#define FIL12_1                          BANKMASK(MSEL3), 1, b
#define FIL13_0                          BANKMASK(MSEL3), 2, b
#define FIL13_1                          BANKMASK(MSEL3), 3, b
#define FIL14_0                          BANKMASK(MSEL3), 4, b
#define FIL14_1                          BANKMASK(MSEL3), 5, b
#define FIL15_0                          BANKMASK(MSEL3), 6, b
#define FIL15_1                          BANKMASK(MSEL3), 7, b
#define FIL1_0                           BANKMASK(MSEL0), 2, b
#define FIL1_1                           BANKMASK(MSEL0), 3, b
#define FIL2_0                           BANKMASK(MSEL0), 4, b
#define FIL2_1                           BANKMASK(MSEL0), 5, b
#define FIL3_0                           BANKMASK(MSEL0), 6, b
#define FIL3_1                           BANKMASK(MSEL0), 7, b
#define FIL4_0                           BANKMASK(MSEL1), 0, b
#define FIL4_1                           BANKMASK(MSEL1), 1, b
#define FIL5_0                           BANKMASK(MSEL1), 2, b
#define FIL5_1                           BANKMASK(MSEL1), 3, b
#define FIL6_0                           BANKMASK(MSEL1), 4, b
#define FIL6_1                           BANKMASK(MSEL1), 5, b
#define FIL7_0                           BANKMASK(MSEL1), 6, b
#define FIL7_1                           BANKMASK(MSEL1), 7, b
#define FIL8_0                           BANKMASK(MSEL2), 0, b
#define FIL8_1                           BANKMASK(MSEL2), 1, b
#define FIL9_0                           BANKMASK(MSEL2), 2, b
#define FIL9_1                           BANKMASK(MSEL2), 3, b
#define FLC0                             BANKMASK(SDFLC), 0, b
#define FLC1                             BANKMASK(SDFLC), 1, b
#define FLC2                             BANKMASK(SDFLC), 2, b
#define FLC3                             BANKMASK(SDFLC), 3, b
#define FLC4                             BANKMASK(SDFLC), 4, b
#define FLT0                             BANKMASK(PORTB), 0, a
#define FP0                              BANKMASK(CANCON), 0, a
#define FP1                              BANKMASK(CANCON), 1, a
#define FP2                              BANKMASK(CANCON), 2, a
#define FP3                              BANKMASK(CANCON), 3, a
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN                             BANKMASK(SSPCON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIN                           BANKMASK(PORTA), 5, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSPSTAT), 5, a
#define I2C_READ                         BANKMASK(SSPSTAT), 2, a
#define I2C_START                        BANKMASK(SSPSTAT), 3, a
#define I2C_STOP                         BANKMASK(SSPSTAT), 4, a
#define IBF                              BANKMASK(TRISE), 7, a
#define IBOV                             BANKMASK(TRISE), 5, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTSCR                           BANKMASK(OSCTUNE), 7, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOFS                             BANKMASK(OSCCON), 2, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define IRXIE                            BANKMASK(PIE3), 7, a
#define IRXIF                            BANKMASK(PIR3), 7, a
#define IRXIP                            BANKMASK(IPR3), 7, a
#define IVRST                            BANKMASK(HLVDCON), 5, a
#define JTOFF                            BANKMASK(RXB0CON), 1, a
#define JTOFF_FILHIT1                    BANKMASK(RXB0CON), 1, a
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
